codeigniter4-framework-b3359be/app/Controllers/AchatController.php

SELECT *
FROM `produits`
WHERE `produits`.`id` = 4
---
    public function ajouter()
    {
        $caisse = session()->get('caisse');
        if (! $caisse) {
            return redirect()->to('/caisse')->with('error', 'Choisis une caisse avant de saisir un achat.');
        }

        $rules = [
            'produit_id' => 'required|is_natural_no_zero',
            'quantite'   => 'required|is_natural_no_zero',
        ];

        if (! $this->validate($rules)) {
            return redirect()->to('/achats')->withInput()->with('error', 'Merci de compléter correctement le formulaire.');
        }

        $produitId = (int) $this->request->getPost('produit_id');
        $quantite = (int) $this->request->getPost('quantite');

        $produitModel = new ProduitModel();
        $produit = $produitModel->find($produitId);

INSERT INTO `achats` (`caisse_id`, `produit_id`, `numero_ticket`, `client_reference`, `quantite`, `prix_unitaire`, `montant_total`, `statut`, `created_at`, `updated_at`) VALUES (1, 4, 'TK-1-20260617081735', NULL, 1, 12000, 12000, 'en_cours', '2026-06-17 08:17:46', '2026-06-17 08:17:46')
UPDATE `produits` SET `quantite_stock` = 28, `updated_at` = '2026-06-17 08:17:46'
WHERE `produits`.`id` IN (4)
---

        $db->transStart();

        $achatModel->insert([
            'caisse_id'         => (int) $caisse['id'],
            'produit_id'        => $produitId,
            'numero_ticket'     => $ticket,
            'client_reference'  => null,
            'quantite'          => $quantite,
            'prix_unitaire'     => $produit['prix'],
            'montant_total'     => $montantTotal,
            'statut'            => 'en_cours',
        ]);

        $produitModel->update($produitId, [
            'quantite_stock' => (int) $produit['quantite_stock'] - $quantite,
        ]);