codeigniter4-framework-b3359be/app/Models/AchatModel.php

SELECT `achats`.*, `produits`.`designation`, `produits`.`prix` AS `produit_prix`
FROM `achats`
JOIN `produits` ON `produits`.`id` = `achats`.`produit_id`
WHERE `caisse_id` = 1
AND `statut` = 'en_cours'
ORDER BY `achats`.`created_at` ASC
---
    public function getOpenItemsForCaisse(int $caisseId): array
    {
        return $this->select('achats.*, produits.designation, produits.prix AS produit_prix')
            ->join('produits', 'produits.id = achats.produit_id')
            ->where('caisse_id', $caisseId)
            ->where('statut', 'en_cours')
            ->orderBy('achats.created_at', 'ASC')
            ->findAll();

UPDATE `achats` SET `statut` = 'cloture', `numero_ticket` = NULL
WHERE `caisse_id` = 1
AND `statut` = 'en_cours'
---
    public function closeCurrentSession(int $caisseId, ?string $ticket = null): bool
    {
        return (bool) $this->builder()
            ->where('caisse_id', $caisseId)
            ->where('statut', 'en_cours')
            ->update([
                'statut' => 'cloture',
                'numero_ticket' => $ticket,
            ]);