codeigniter4-framework-b3359be/app/Models/CaisseModel.php

    public function getActiveCaisses(): array
    {
        return $this->where('active', 1)
            ->orderBy('numero', 'ASC')
            ->findAll();
---
SELECT *
FROM `caisses`
WHERE `active` = 1
ORDER BY `numero` ASC

    public function findActiveByNumero(int $numero): ?array
    {
        $caisse = $this->where('numero', $numero)
            ->where('active', 1)
            ->first();
---
SELECT *
FROM `caisses`
WHERE `numero` = 2
AND `active` = 1
 LIMIT 1