codeigniter4-framework-b3359be/app/Models/ProduitModel.php

    public function getAllProducts(): array
    {
        return $this->orderBy('designation', 'ASC')->findAll();
---
SELECT *
FROM `produits`
ORDER BY `designation` ASC